<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Meeting;
use App\Models\Theme;
use Illuminate\Support\Facades\Hash;

class MeetingSeeder extends Seeder
{
    public function run()
    {

        $theme = Theme::first();

        // Создание тестовых пользователей
        Meeting::create([
            'name' => 'Мастер-класс по живописи',
            'place' => 'Арт-студия "Краски", ул. Творческая, 15',
            'date' => '2025-04-26 09:01:06', // Хеширование пароля
            'time' => '16:00',
            'description' => 'Увлекательный мастер-класс для начинающих художников. Научимся основам акварельной живописи и создадим собственный пейзаж. Все материалы предоставляются.',
            'available_seats' => '10',
            "theme_id" => $theme->id,
        ]);

        Meeting::create([
            'name' => 'Бесплатный вебинар по digital-маркетингу',
            'place' => 'Онлайн',
            'date' => '2025-05-26 09:01:06', // Хеширование пароля
            'time' => '03:11',
            'description' => 'Практический вебинар для предпринимателей и маркетологов. Разберём тренды SMM, таргетированную рекламу и контент-стратегии.',
            'available_seats' => '100',
            "theme_id" => $theme->id,
        ]);
        Meeting::create([
            'name' => 'Фестиваль уличной еды "Вкусный город"',
            'place' => 'test',
            'date' => '2025-04-30 09:01:06', // Хеширование пароля
            'time' => '12:30',
            'description' => 'Гастрономический фестиваль с участием лучших фудтраков города. Дегустации, конкурсы, живая музыка. Вход свободный, но на некоторые мастер-классы требуется регистрация.',
            'available_seats' => '200',
            "theme_id" => $theme->id,
        ]);
        Meeting::create([
            'name' => 'Турнир по настольным играм',
            'place' => 'Коворкинг "Игротека", ул. Игровая, 7',
            'date' => '2025-04-16 09:01:06', // Хеширование пароля
            'time' => '10:10',
            'description' => 'Соревнования по популярным настольным играм: "Каркассон", "Колонизаторы", "Манчкин". Призы для победителей!',
            'available_seats' => '25',
            "theme_id" => $theme->id,
        ]);

      
    }
}